Tekla Open API Reference for Tekla Structures 2025
Shell.GetEdgeEnumerator Method
 Returns a new edge enumerator in the current plane.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public EdgeEnumerator GetEdgeEnumerator()
Public Function GetEdgeEnumerator As EdgeEnumerator
Return Value
Type: EdgeEnumerator
An edge enumerator to enumerate through the shell's edges.
See Also
Reference
Shell Class
Tekla.Structures.Solid Namespace